data/perf/stageB-d3bf9f8c39fe/memcached/tsan/run2/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       149617.68          ---          ---         5.15232         5.15100        11.45500        14.27100     10211.36 
Gets      1496160.38      1201.42   1494958.97         5.03057         4.99100        11.19900        14.07900     37896.84 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1645778.07      1201.42   1494958.97         5.04164         4.99100        11.19900        14.07900     48108.20 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       136285.77          ---          ---         5.52688         5.56700        12.03100        15.16700      9301.46 
Gets      1362842.74      1094.36   1361748.37         5.39546         5.40700        11.83900        14.97500     34519.98 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1499128.51      1094.36   1361748.37         5.40740         5.40700        11.83900        14.97500     43821.44 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       145594.11          ---          ---         5.22463         5.21500        11.51900        14.46300      9936.75 
Gets      1455925.08      1064.52   1454860.56         5.10127         5.08700        11.32700        14.27100     36871.38 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1601519.19      1064.52   1454860.56         5.11249         5.08700        11.32700        14.33500     46808.13